org-files/superfile.org
:PROPERTIES:
:ID:       d67ed8bb-4123-4718-ac94-bb082e403807
:END:
#+title: superfile
#+STARTUP: overview
#+date: 2025-09-12

https://github.com/yorukot/superfile

- instalar en linux

  bash -c "$(curl -sLo- https://superfile.netlify.app/install.sh)"

  🎉 Installation complete!
  You can type "spf" to start!


Instalar la fuente "Nerdfont" -> https://www.nerdfonts.com/font-downloads
Copiar la carpeta a /usr/share/fonts
Regenerar la caché -> ~fc-cache -f -v~
Abrir una terminal y con el menú derecho "mostrár barra de menús"
Texto - Tipografía personalizada - Nerdfont

Guía de inicio -> https://superfile.netlify.app/getting-started/tutorial/
