public_html/superfile.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>superfile</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">superfile</h1>
<p>
<a href="https://github.com/yorukot/superfile">https://github.com/yorukot/superfile</a>
</p>

<ul class="org-ul">
<li><p>
instalar en linux
</p>

<p>
bash -c "$(curl -sLo- <a href="https://superfile.netlify.app/install.sh">https://superfile.netlify.app/install.sh</a>)"
</p>

<p>
🎉 Installation complete!
You can type "spf" to start!
</p></li>
</ul>


<p>
Instalar la fuente "Nerdfont" -&gt; <a href="https://www.nerdfonts.com/font-downloads">https://www.nerdfonts.com/font-downloads</a>
Copiar la carpeta a /usr/share/fonts
Regenerar la caché -&gt; <code>fc-cache -f -v</code>
Abrir una terminal y con el menú derecho "mostrár barra de menús"
Texto - Tipografía personalizada - Nerdfont
</p>

<p>
Guía de inicio -&gt; <a href="https://superfile.netlify.app/getting-started/tutorial/">https://superfile.netlify.app/getting-started/tutorial/</a>
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-12</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
